app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (LOWER(bookname) LIKE '%romeo')
---
  def index
    @books = Book.all

INSERT INTO "books" ("bookname", "bookdescription", "vendorname", "vendormail", "userid", "created_at", "updated_at", "status", "position") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = ?, "position" = ? WHERE "books"."id" = ?  [["updated_at", "2021-10-24 07:13:54.652657"], ["position", "self 2 rack 5"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)