app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors"
---
  def index
    @vendors = Vendor.all

INSERT INTO "vendors" ("vendor_name", "vendor_mail", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["vendor_name", "ABC"], ["vendor_mail", "ABC@gmail.com"], ["created_at", "2021-10-24 07:27:06.218626"], ["updated_at", "2021-10-24 07:27:06.218626"]]
---
  def create
    @vendor = Vendor.new(vendor_params)

    respond_to do |format|
      if @vendor.save

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_vendor
      @vendor = Vendor.find(params[:id])